<!DOCTYPE html>
<html lang="en">
<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta name="Resource-type" content="Document">
    <!--禁止缩放-->
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
    <!--禁止数字识别为手机号-->
    <meta name="format-detection" content="telephone=no">
    <meta http-equiv="X-UA-Compatible" content="IE=Edge">
    <meta http-equiv="Expires" content="0">
    <meta http-equiv="Pragma" content="no-cache">
    <meta http-equiv="Cache-control" content="no-cache">
    <meta http-equiv="Cache" content="no-cache">
    <title>机构详情</title>
    <style type="text/css">
        *{
            color: #333;
        }
        p{
            font-size: 12px;
            line-height: 27px;
        }
        h2{
            margin-left: 0;
        }
    </style>
</head>
<body>
<h2>半课软件许可及服务协议</h2>
<div>
    <p>【首部及导言】<br />
    欢迎您使用半课软件及服务！</br>
    为使用半课软件（以下简称“本软件”）及服务，您应当阅读并遵守《半课软件许可及服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容。限制、免责条款可能以加粗形式提示您注意。</br>
    除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本软件及相关服务。您的下载、安装、使用、获取帐号、登录等行为即视为您已阅读并同意上述协议的约束。</br>
    如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。 </p>
    <p>一、【协议的范围】<br />
        1.1 【协议适用主体范围】<br />
        本协议是您与我们关于您下载、安装、使用、复制本软件，以及使用相关服务所订立的协议。
    </p>
    <p>二、【关于本服务】<br />
        2.1 【本服务的内容】<br />
        本服务内容是指我们向用户提供的跨平台的培训学费返现平台（以下简称“半课”），用户通过本平台缴纳培训学费可获得返现服务（以下简称“本服务”）。<br />
        2.2 【本服务的形式】<br />
        2.2.1 您使用本服务需要下载半课客户端软件。您仅可为访问或使用本服务的目的而使用这些软件及服务。<br />
        2.2.2 本服务中半课客户端软件提供包括但不限于ios、android等多个应用版本，用户必须选择与所安装手机相匹配的软件版本。
    </p>
    <p>三、【软件的获取】<br />
        3.1 您可以直接从我们的网站上获取本软件，也可以从得到授权的第三方获取。<br />
        3.2 如果您从未经授权的第三方获取本软件或与本软件名称相同的安装程序，我们无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。
    </p>
    <p>四、【软件的安装与卸载】<br />
        4.1 我们可能为不同的终端设备开发了不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。<br />
        4.2 下载安装程序后，您需要按照该程序提示的步骤正确安装。<br />
        4.3 如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。
    </p>
    <p>五、【软件的更新】<br />
        5.1 为了改善用户体验、完善服务内容，我们将不断努力开发新的服务，并为您不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。<br />
        5.2 为了保证本软件及服务的安全性和功能的一致性，我们有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。<br />
        5.3 本软件新版本发布后，旧版本的软件可能无法使用。我们不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。
    </p>
    <p>六、【用户个人信息保护】<br />
        6.1 保护用户个人信息是我们的一项基本原则，我们将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可我们不会向第三方公开、透露用户个人信息。我们对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。<br />
        6.2 您在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供帐号注册服务或进行用户身份识别，需要您填写手机号码；附近的人功能需要您同意使用您所在的地理位置信息；手机通讯录匹配功能需要您授权访问手机通讯录等。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。<br />
        6.3 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。<br />
        6.4 未经您的同意，我们不会其他第三方的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。<br />
        6.6 我们非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用本服务前，应事先取得您家长或法定监护人的书面同意。
    </p>
    <p>七、【主权利义务条款】<br />
        7.1 【帐号使用规范】<br />
        7.1.1 您在使用本服务部分功能前需要注册一个帐号。<br />
        7.1.2 帐号的所有权归武汉迅牛科技有限公司所有，用户完成申请注册手续后，仅获得帐号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖帐号或者以其他方式许可非初始申请注册人使用帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用账号。<br />
        7.1.3 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，您应立即通知武汉迅牛科技有限公司。<br />
        7.1.4 用户注册帐号后如果长期不登录该帐号，我们有权回收该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。<br />
        7.2 【用户注意事项】<br />
        7.2.1 您理解并同意：为了向您提供有效的服务，本软件会利用您移动通讯终端的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。<br />
        7.2.2 您理解并同意我们将会尽其商业上的合理努力保障您在本软件及服务中的数据存储安全，但是，并不能就此提供完全保证，包括但不限于以下情形：<br />
        7.2.2.1 我们不对您在本软件及服务中相关数据的删除或储存失败负责；<br />
        7.2.2.2 我们有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本软件及服务中的相关数据；<br />
        7.2.2.3 如果您停止使用本软件及服务或服务被终止或取消，我们可以从服务器上永久地删除您的数据。服务停止、终止或取消后，我们没有义务向您返还任何数据。<br />
        7.2.3 用户在使用本软件及服务时，须自行承担如下不可掌控的风险内容，包括但不限于：<br />
        7.2.3.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；<br />
        7.2.3.2 用户必须选择与所安装手机相匹配的软件版本，否则，由于软件与手机型号不相匹配所导致的任何问题或损害，均由用户自行承担；<br />
        7.2.3.4 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的登录失败、资料同步不完整、页面打开速度慢等风险。
    </p>
    <p>八、【用户行为规范】<br />
        8.1 【信息内容规范】<br />
        8.1.1 本条所述信息内容是指用户使用本软件及服务过程中所制作、复制、发布、传播的任何内容。<br />
        8.1.2 您理解并同意，我们一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用帐号或本软件及服务制作、复制、发布、传播如下干扰微信正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：<br />
        8.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：<br />
        （1）违反宪法确定的基本原则的；<br />
        （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br />
        （3）损害国家荣誉和利益的；<br />
        （4）煽动民族仇恨、民族歧视，破坏民族团结的；<br />
        （5）破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
        （6）散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
        （7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br />
        （8）侮辱或者诽谤他人，侵害他人合法权益的；<br />
        （9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br />
        （10）以非法民间组织名义活动的；<br />
        （11）含有法律、行政法规禁止的其他内容的。<br />
        8.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；<br />
        8.1.2.3 涉及他人隐私、个人信息或资料的；<br />
        8.1.2.4 发表、传送、传播骚扰、广告信息及垃圾信息或含有任何性或性暗示的；<br />
        8.2 【软件使用规范】<br />
        除非法律允许或我们书面许可，您使用本软件过程中不得从事下列行为：<br />
        8.2.1 删除本软件及其副本上关于著作权的信息；<br />
        8.2.2 对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码； <br />
        8.2.3 对拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；<br />
        8.2.4 对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或未经授权的第三方工具/服务接入本软件和相关系统；<br />
        8.2.5 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br />
        8.2.6 自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；<br />
        8.3 【服务运营规范】<br />
        除非法律允许或腾讯书面许可，您使用本服务过程中不得从事下列行为：<br />
        8.3.1 提交、发布虚假信息，或冒充、利用他人名义的；<br />
        8.3.2 诱导其他用户点击链接页面或分享信息的；<br />
        8.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；<br />
        8.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；<br />
        8.3.5 未经腾讯书面许可利用微信帐号和任何功能，以及第三方运营平台进行推广或互相推广的；<br />
        8.3.6 利用微信帐号或本软件及服务从事任何违法犯罪活动的；<br />
        8.3.7 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；<br />
        8.3.8 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或腾讯未明示授权的行为。<br />
        8.4 【对自己行为负责】<br />
        您充分了解并同意，您必须为自己注册帐号下的一切行为负责。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。我们无法且不会对因前述风险而导致的任何损失或损害承担责任。
    </p>
    <p>九、【终端安全责任】<br />
        10.1 您理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。<br />
        10.2 您不得制作、发布、使用、传播用于窃取帐号及他人个人信息、财产的恶意程序。
    </p>
    <p>十一、【第三方软件或技术】<br />
        11.1 本软件可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。<br />
        11.2 如因本软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，我们不承担任何责任。
    </p>
    <p>十二、【其他】<br />
        12.1 您使用本软件即视为您已阅读并同意受本协议的约束。我们有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。<br />
        12.2 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。<br />
        12.3 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（正文完）
    </p>
    <p>武汉迅牛科技有限公司<br />
        Wuhan xuniu Technology Co.,Ltd. All Rights Reserved  </p>
</div>
</body>
</html>